---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemContourSide1dist
source: html/0d3535c2-ca69-d590-f40e-f3da0c51e7e4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemContourSide1dist Property

"Boundary distance 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemContourSide1dist { get; }
```